[
	{
		"type": "Ground Formations",
		"formations": [
			{
				"id": 1,
				"name": "Battle",
				"bonus": "The Battle Lance formation receives the equivalent of a Lucky Special Pilot Ability (see p.97) as a level of the number of units in the formation at Setup plus two.",
				"ideal": "Brawler",
				"page": "AS:CE pg.117",
				"grantedSPAs": ["Lucky"],
				"variations": [
					{
						"id": 2,
						"name": "Light Battle",
						"bonus": "The Battle Lance formation receives the equivalent of a Lucky Special Pilot Ability (see p.97) as a level of the number of units in the formation at Setup plus two.",
						"page": "AS:CE pg.117",
						"grantedSPAs": ["Lucky"]
					},
					{
						"id": 3,
						"name": "Medium Battle",
						"bonus": "The Battle Lance formation receives the equivalent of a Lucky Special Pilot Ability (see p.97) as a level of the number of units in the formation at Setup plus two.",
						"page": "AS:CE pg.117",
						"grantedSPAs": ["Lucky"]
					},
					{
						"id": 4,
						"name": "Heavy Battle",
						"bonus": "The Battle Lance formation receives the equivalent of a Lucky Special Pilot Ability (see p.97) as a level of the number of units in the formation at Setup plus two.",
						"page": "AS:CE pg.117",
						"grantedSPAs": ["Lucky"]
					}
				]
			},
			{
				"id": 5,
				"name": "Assault",
				"bonus": "At the beginning of play, the Assault Lance's controlling player must choose either the Demoralizer or the Multi-Tasker SPAs (see pp. 93 and 98, respectively). When each turn of game play begins, the player may designate up to half the units in the Assault Lance (rounded down) to receive the chosen ability for the duration of the turn. Destroyed or withdrawn units do not count towards the current number of units in the formation.",
				"ideal": "Juggernaut",
				"page": "AS:CE pg.118",
				"grantedSPAs": ["Demoralizer", "Multi-Tasker"],
				"variations": [
					{
						"id": 6,
						"name": "Fast Assault",
						"bonus": "At the beginning of play, the Assault Lance's controlling player must choose either the Demoralizer or the Multi-Tasker SPAs (see pp. 93 and 98, respectively). When each turn of game play begins, the player may designate up to half the units in the Assault Lance (rounded down) to receive the chosen ability for the duration of the turn. Destroyed or withdrawn units do not count towards the current number of units in the formation. In addition to the bonus ability granted for the standard Assault lance, up to 2 units per Fast Assault Lance may also receive the Stand Aside SPA per turn (see p.99). These two units need not be the same ones that are granted the Demoralizer or Multi-Tasker abilities, and it is possible for a Fast Assault Lance unit to thus receive two SPAs in the same turn as a result.",
						"page": "AS:CE pg.118",
						"grantedSPAs": ["Demoralizer", "Multi-Tasker", "Stand Aside"]
					}
				]
			},
			{
				"id": 7,
				"name": "Striker/Cavalry",
				"bonus": "75 percent of the units in a standard Striker/Cavalry Lance (round normally) receive the Speed Demon Special Pilot Ability (see p.99).",
				"ideal": "Striker",
				"page": "AS:CE pg.118",
				"grantedSPAs": ["Speed Demon"],
				"variations": [
					{
						"id": 8,
						"name": "Light Striker/Cavalry",
						"bonus": "75 percent of the units in a standard Striker/Cavalry Lance (round normally) receive the Speed Demon Special Pilot Ability (see p.99).",
						"page": "AS:CE pg.118",
						"grantedSPAs": ["Speed Demon"]
					},
					{
						"id": 9,
						"name": "Heavy Striker/Cavalry",
						"bonus": "75 percent of the units in a standard Striker/Cavalry Lance (round normally) receive the Speed Demon Special Pilot Ability (see p.99).",
						"page": "AS:CE pg.118",
						"grantedSPAs": ["Speed Demon"]
					}
				]
			},

			{
				"id": 10,
				"name": "Fire",
				"bonus": "At the beginning of each turn, up to half the Fire Lance units (rounded down) may receive the Sniper Special Pilot Ability (see p.99), which will affect their weapon attacks during that turn. Destroyed or withdrawn units do not count towards the current number of units in the formation.",
				"ideal": "Missile Boat",
				"page": "AS:CE pg.119",
				"grantedSPAs": ["Sniper"],
				"variations": [
					{
						"id": 11,
						"name": "Fire Support",
						"bonus": "At the beginning of each turn, up to half the Fire Support Lance units (rounded down) may receive the Oblique Attacker Special Pilot Ability (see p.98), which will affect their weapon attacks during that turn. Destroyed or withdrawn units do not count towards the current number of units in the formation.",
						"page": "AS:CE pg.119",
						"grantedSPAs": ["Oblique Attacker"]
					},
					{
						"id": 12,
						"name": "Artillery Fire",
						"bonus": "At the beginning of each turn, up to half the Artillery Fire Lance units (rounded down) may receive the Oblique Artilleryman Special Pilot Ability (see p.98), which will affect their weapon attacks during that turn. Destroyed or withdrawn units do not count towards the current number of units in the formation.",
						"page": "AS:CE pg.119",
						"grantedSPAs": ["Oblique Artilleryman"]
					},
					{
						"id": 13,
						"name": "Direct Fire",
						"bonus": "At the beginning of each turn, up to half the Direct Fire Lance units (rounded down) may receive the Weapon Specialist Special Pilot Ability (see p.101), which will affect their weapon attacks during that turn. Destroyed or withdrawn units do not count towards the current number of units in the formation.",
						"page": "AS:CE pg.119",
						"grantedSPAs": ["Weapon Specialist"]
					},
					{
						"id": 14,
						"name": "Anti-Air",
						"bonus": "At the beginning of each turn, up to half the Anti-Air Lance units (rounded down) may receive the effects of the Anti-Aircraft Specialists Special Command Ability (see p.102), which will affect their weapon attacks during that turn. Destroyed or withdrawn units do not count towards the current number of units in the formation ",
						"page": "AS:CE pg.119",
						"grantedSCAs": ["Anti-Aircraft Specialist"]
					},
					{
						"id": 15,
						"name": "Light Fire",
						"bonus": "Coordinated Fire Support. If a unit in this Formation hits a target with at least one of its weapons (at least one weapon attack), other units in this Formation making weapon attacks against the same target receive a -1 target number modifier to their attack rolls. This bonus is cumulative per attacking unit, up to a -3 target number modifier.",
						"page": "FM:D pg.82"
					}
				]
			},
			{
				"id": 16,
				"name": "Recon",
				"bonus": "At the beginning of play, the Recon Lance's controlling player must choose either the Eagle's Eyes, Forward Observer, or Maneuvering Ace SPAs (see pp. 95, 96, and 97, respectively). Every unit in this Recon Lance receives the chosen SPA.",
				"ideal": "Scout",
				"page": "AS:CE pg.119",
				"grantedSPAs": ["Eagle's Eyes", "Forward Observer", "Maneuvering Ace"],
				"variations": [
					{
						"id": 17,
						"name": "Light Recon",
						"bonus": "At the beginning of play, every unit in this Recon Lance receives either the Eagle's Eyes, Forward Observer, or Maneuvering Ace SPAs (see pp. 95, 96, and 97, respectively). ",
						"page": "AS:CE pg.119",
						"grantedSPAs": ["Eagle's Eyes", "Forward Observer", "Maneuvering Ace"]
					},
					{
						"id": 18,
						"name": "Heavy Recon",
						"bonus": "At the beginning of play, the Recon Lance's controlling player must choose either the Eagle's Eyes, Forward Observer, or Maneuvering Ace SPAs (see pp. 95, 96, and 97, respectively). Half the units in the Heavy Recon Lance (round up) may receive the chosen SPA",
						"page": "AS:CE pg.",
						"grantedSPAs": ["Eagle's Eyes", "Forward Observer", "Maneuvering Ace"]
					}
				]
			},
			{
				"id": 19,
				"name": "Pursuit",
				"bonus": "75 percent of the units in this formation receive the Blood Stalker Special Pilot Ability (see p.93). The Pursuit Lance may choose an enemy Formation rather than a single unit as the target for the Blood Stalker SPA. If this option is used, all members of the Pursuit Lance must choose the same enemy Formation for the Blood Stalker SPA granted by this ability, and the destruction of the chosen Formation is the only time the Pursuit Lance may change the target of the Blood Stalker SPA, by choosing a new enemy Formation ",
				"ideal": "Skirmisher",
				"page": "AS:CE pg.120",
				"grantedSPAs": ["Blood Stalker"],
				"variations": [
					{
						"id": 20,
						"name": "Probe",
						"bonus": "75 percent of the units in this formation receive the Blood Stalker Special Pilot Ability (see p.93). The Pursuit Lance may choose an enemy Formation rather than a single unit as the target for the Blood Stalker SPA. If this option is used, all members of the Pursuit Lance must choose the same enemy Formation for the Blood Stalker SPA granted by this ability, and the destruction of the chosen Formation is the only time the Pursuit Lance may change the target of the Blood Stalker SPA, by choosing a new enemy Formation ",
						"page": "AS:CE pg.120",
						"grantedSPAs": ["Blood Stalker"]
					},
					{
						"id": 21,
						"name": "Sweep",
						"bonus": "75 percent of the units in this formation receive the Blood Stalker Special Pilot Ability (see p.93). The Pursuit Lance may choose an enemy Formation rather than a single unit as the target for the Blood Stalker SPA. If this option is used, all members of the Pursuit Lance must choose the same enemy Formation for the Blood Stalker SPA granted by this ability, and the destruction of the chosen Formation is the only time the Pursuit Lance may change the target of the Blood Stalker SPA, by choosing a new enemy Formation ",
						"page": "AS:CE pg.120",
						"grantedSPAs": ["Blood Stalker"]
					}
				]
			},
			{
				"id": 22,
				"name": "Command",
				"bonus": "Prior to the beginning of play, half of the units in this formation (round up) receive one of the following Special Pilot Abilities for free (each unit may receive a different SPA): Antagonizer, Blood Stalker, Combat Intuition, Eagle's Eyes, Marksman, or Multi-Tasker (see pp. 92, 93, 93, 95, 97, and 98, respectively). In addition to this, the commander's unit receives the Tactical Genius SPA (see p.100). If the Special Pilot Abilities rules are in full effect and the commander already has the Tactical Genius SPA, this ability adds a +1 modifier to the force's Initiative roll results instead (including any rerolls made as a result of the Tactical Genius SPA) ",
				"page": "AS:CE pg.120",
				"grantedSPAs": ["Antagonizer", "Blood Stalker", "Combat Intuition", "Eagle's Eyes", "Marksman", "Multi-Tasker", "Tactical Genius"],
				"variations": [
					{
						"id": 23,
						"name": "Vehicle Command",
						"bonus": "Prior to the beginning of play, half of the units in this formation (round up) receive one of the following Special Pilot Abilities for free (each unit may receive a different SPA): Antagonizer, Blood Stalker, Combat Intuition, Eagle's Eyes, Marksman, or Multi-Tasker (see pp. 92, 93, 93, 95, 97, and 98, respectively). In addition to this, the commander's unit receives the Tactical Genius SPA (see p.100). If the Special Pilot Abilities rules are in full effect and the commander already has the Tactical Genius SPA, this ability adds a +1 modifier to the force's Initiative roll results instead (including any rerolls made as a result of the Tactical Genius SPA) ",
						"page": "AS:CE pg.120",
						"grantedSPAs": ["Antagonizer", "Blood Stalker", "Combat Intuition", "Eagle's Eyes", "Marksman", "Multi-Tasker", "Tactical Genius"]
					}
				]
			},
			{
				"id": 24,
				"name": "Support",
				"bonus": "Before the start of play, each Support Lance must designate one other formation type in its army to support. Half of the units in the Support Lance (round down) receive the same SPAs as the supported formation. The Support Lance's number of SPAs received of each type may not exceed the number the supported formation receives, as determined at start of play. If a bonus ability from the supported formation is assigned at the beginning of each turn, the Support Lance must assign them at start of play and may not switch them to another unit during game play. This bonus ability is retained as long as the Support Lance still has three or more active units on the field; they are not lost if the supported lance is reduced below its own ability to retain the bonus ability. If the Support Lance is supporting a Command Lance, it receives the two SPAs assigned to the Command Lance's non-commander units, assigning one SPA each to any appropriate Support Lance unit. However, the Support Lance does not receivethe commander's Tactical Genius Special Pilot Ability.",
				"page": "AS:CE pg.121"
			},
			{
				"id": 25,
				"name": "Transport and Infantry",
				"bonus": "Choose Either Mechanized or Nova.Mechanized: Transport units of the Mechanized formation may dismount the infantry units during non-airborne ground movement. After dismounting, the transport may continue to use any remaining Move.Nova: Mounted infantry of this formation may make weapon attacks. These mounted attacks use the attacker movement modifier of the transport and have an additional +2 Target Number modifier for being mounted ",
				"page": "AS:CE pg.121"
			},
			{
				"id": 26,
				"name": "Air Lance",
				"bonus": "No additional bonus ability is granted by this formation; the fighters do not benefit from the bonus abilities gained by the ground units' lance formation, and are not counted towards any of the Air Lance's requirements.",
				"page": "AS:CE pg.121"
			},
			{
				"id": 27,
				"name": "Hunter",
				"bonus": "At the beginning of each turn, 50 percent of the units in the Formation may be granted the Combat Intuition Special Pilot Ability.",
				"page": "FM:D pg.82",
				"grantedSPAs": ["Combat Intuition"]
			},
			{
				"id": 28,
				"name": "Horde",
				"bonus": "Swarm - When any Unit in this Formation is targeted, the targeted Unit's player may switch the target to any other Unit in this Formation that is a legal target (within line of sight) and at the same range (or less) from the attacker.",
				"page": "FM:K pg.87"
			},
			{
				"id": 29,
				"name": "Berserker (Close Combat)",
				"bonus": "Two Units of the Formation receive the Zweihander or Swordsman Special Pilot Ability; the same ability must be assigned to both Units.",
				"page": "FM:K pg.87",
				"grantedSPAs": ["Zweihander", "Swordsman"]
			},
			{
				"id": 30,
				"name": "Anti-'Mech",
				"bonus": "Enemy Units in base-to-base contact with an Anti-'Mech Lance suffer a -1 To-Hit Modifier penalty to any weapon attacks made by that enemy Unit.",
				"page": "FM:K pg.87"
			}
		]
	},
	{
		"type": "Air Formations",
		"formations": [
			{
				"id": 31,
				"name": "Interceptor Squadron",
				"bonus": "Any units in an Interceptor Squadron with a Move (Thrust) of 9 or less receive the Speed Demon SPA (see p.99). In addition to this, up to 2 fighters in this squadron may receive the Range Master (Long) SPA as well.",
				"page": "AS:CE pg.122",
				"grantedSPAs": ["Speed Demon", "Range Master (Long)"]
			},
			{
				"id": 32,
				"name": "Aerospace Superiority Squadron",
				"bonus": "Prior to the start of the scenario, select up to 50 percent of the units in the Aerospace Superiority Squadron and assign up to 2 of the following SPAs to those fighters (in any combination): Blood Stalker (see p.93), Ride the Wash (see p.98), Hot Dog (see p.97).",
				"page": "AS:CE pg.122",
				"grantedSPAs": ["Blood Stalker", "Ride the Wash", "Hot Dog"]
			},
			{
				"id": 33,
				"name": "Fire Support Squadron",
				"bonus": "Prior to the start of the scenario, choose 2 pairs of fighters in the Fire Support Squadron and assign one of the following SPAs each to each pair: Golden Goose (see p.96), Ground-Hugger (see p.96), Hot Dog (see p.97), or Shaky Stick (see p.99). The two selected fighter pairs may not receive the same SPA (e.g. if one pair of fighters is assigned the Shaky Stick SPA, the second pair may not also receive Shaky Stick SPA.)",
				"page": "AS:CE pg.122",
				"grantedSPAs": ["Golden Goose", "Ground-Hugger", "Hot Dog", "Shaky Stick"]
			},
			{
				"id": 34,
				"name": "Strike Squadron",
				"bonus": "Up to 50 percent of the units in this formation may receive the Speed Demon SPA (see p.99). The remaining fighters receive the Golden Goose SPA (see p.96).",
				"page": "AS:CE pg.122",
				"grantedSPAs": ["Speed Demon", "Golden Goose"]
			},
			{
				"id": 35,
				"name": "Electronic Warfare Squadron",
				"bonus": "This squadron type receives the Communications Disruption Special Command Ability (see p.103), enabling it to disrupt the communications between the units of one randomly-determined enemy lance or squadron on a 1D6 roll of 6. This disruption roll is made at the start of the EW Squadron's turn, and persists for one turn only. If the full Special Command Abilities rules are in use and the EW Squadron is part of a force that already has the Communications Disruption SCA, the EW Squadron gain the ability to decide which enemy lance or squadron is affected by the disruption, rather than resolving its victim randomly.Note that ground units can only suffer Communications Disruption effects if the EW squadron has a unit currently flying over the map where the ground units are operating.",
				"page": "AS:CE pg.122",
				"grantedSCAs": ["Communications Disruption"]
			},
			{
				"id": 36,
				"name": "Transport Squadron",
				"bonus": "Choose one of the following SPAs and apply it to all of the units in this squadron that are of the Transport unit role: Dust-Off (see p.95), Ride the Wash (see p.98), or Wind Walker (see p.101).",
				"page": "AS:CE pg.123",
				"grantedSPAs": ["Dust-Off", "Ride the Wash", "Wind Walker"]
			}
		]
	},
	{
		"type": "Faction Specific Formations",
		"formations": [
			{
				"id": 37,
				"name": "Rifle (House Davion)",
				"bonus": "At the beginning of each turn, up to two Rifle Lance units may receive either the Weapon Specialist or Sandblaster Special Pilot Ability. The player may assign the same SPA to both units, or one unit may receive Weapon Specialist and the other unit Sandblaster.",
				"page": "FM:D pg.82",
				"grantedSPAs": ["Weapon Specialist", "Sandblaster"]
			},
			{
				"id": 38,
				"name": "Order (House Kurita)",
				"bonus": "Designate one Unit as the command Unit of the Formation; it receives the Tactical Genius, Antagonizer or Sniper SPA. All Units in the Formation receive the Iron Will or Speed Demon SPA; the SPA chosen applies to all Units in the Formation.",
				"page": "FM:K pg.87",
				"grantedSPAs": ["Tactical Genius", "Antagonizer", "Sniper", "Iron Will", "Speed Demon"]
			}
		]
	}
]
